
### Helmfile Diff


```diff


Acquiring state lock. This may take a few moments...
azurerm_resource_group.dev-rg: Refreshing state... [id=/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # azurerm_nat_gateway.ng-dev will be created
  + resource "azurerm_nat_gateway" "ng-dev" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "centralindia"
      + name                    = "ng-dev"
      + resource_group_name     = "dev-rg"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

  # azurerm_resource_group.dev-rg will be updated in-place
  ~ resource "azurerm_resource_group" "dev-rg" {
        id         = "/subscriptions/dfd8337f-cfa2-4c58-b812-43579cbc2396/resourceGroups/dev-rg"
        name       = "dev-rg"
      ~ tags       = {
            "CreatedByTerraform" = "true"
            "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.subnet-pub-dev-01 will be created
  + resource "azurerm_subnet" "subnet-pub-dev-01" {
      + address_prefixes                               = [
          + "192.168.18.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet-pub-dev-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "dev-rg"
      + virtual_network_name                           = "vnet-dev"
    }

  # azurerm_subnet_nat_gateway_association.name will be created
  + resource "azurerm_subnet_nat_gateway_association" "name" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_virtual_network.vnet-dev will be created
  + resource "azurerm_virtual_network" "vnet-dev" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "vnet-dev"
      + resource_group_name = "dev-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CreatedByTerraform" = "true"
          + "Environment"        = "dev"
          + "OwningProjects"     = "All"
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Error: "dev-rg" was not found in the list of supported Azure Locations: "australiacentral,australiacentral2,australiaeast,australiasoutheast,brazilsouth,brazilsoutheast,brazilus,canadacentral,canadaeast,centralindia,centralus,centraluseuap,eastasia,eastus,eastus2,eastus2euap,francecentral,francesouth,germanynorth,germanywestcentral,israelcentral,italynorth,japaneast,japanwest,jioindiacentral,jioindiawest,koreacentral,koreasouth,malaysiasouth,mexicocentral,newzealandnorth,northcentralus,northeurope,norwayeast,norwaywest,polandcentral,qatarcentral,southafricanorth,southafricawest,southcentralus,southeastasia,southindia,spaincentral,swedencentral,swedensouth,switzerlandnorth,switzerlandwest,uaecentral,uaenorth,uksouth,ukwest,westcentralus,westeurope,westindia,westus,westus2,westus3,australiaeastfoundational,austriaeast,chilecentral,eastusfoundational,eastusslv,indonesiacentral,israelnorthwest,malaysiawest,southcentralus2,southeastus,southwestus,uksouthfoundational"

  with azurerm_public_ip.ip-dev,
  on global_resources.tf line 26, in resource "azurerm_public_ip" "ip-dev":
  26:   location = azurerm_resource_group.dev-rg.name

Releasing state lock. This may take a few moments...
time=2024-06-30T13:59:40Z level=error msg=terraform invocation failed in /home/runner/work/azure-terraform-infra/azure-terraform-infra/terraform/global error=[/home/runner/work/azure-terraform-infra/azure-terraform-infra/terraform/global] exit status 1
time=2024-06-30T13:59:40Z level=error msg=1 error occurred:
	* [/home/runner/work/azure-terraform-infra/azure-terraform-infra/terraform/global] exit status 1




```
